<a href="https://colab.research.google.com/github/RiteshopShrivastava/Hierarchical_Clustering/blob/main/Assignment_Q1_Clustering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pylab as plt

In [8]:
airlines = pd.read_excel("EastWestAirlines.xlsx")
airlines.head(10)

   ID#  Balance  Qual_miles  ...  Flight_trans_12  Days_since_enroll  Award?
0    1    28143           0  ...                0               7000       0
1    2    19244           0  ...                0               6968       0
2    3    41354           0  ...                0               7034       0
3    4    14776           0  ...                0               6952       0
4    5    97752           0  ...                4               6935       1
5    6    16420           0  ...                0               6942       0
6    7    84914           0  ...                0               6994       0
7    8    20856           0  ...                1               6938       1
8    9   443003           0  ...               12               6948       1
9   10   104860           0  ...                3               6931       1

[10 rows x 12 columns]